// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]

// let arr1 = [101, 102, 103, 104, 105, 106, 107, 108, 109];
// let arr2 = [19, 28, 37, 46, 55, 64, 73, 82, 91];
// let arr3 = [];
//
// function someFunc() {
//     for (i=0; i < arr1.length; i++) {
//         if (arr1.i === arr2.i) {
//             arr3.push(arr1[i] + arr2[i]);
//         }
//     }
//     return arr3;
// }
// console.log(someFunc());

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

// let arr = ['a', 'b', 'c'];
//
// for (let i = 2; i < 3; i++) {
//     arr.push(1, 2, 3);
// }
//
// console.log(arr);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

// let items = [1, 2, 3];
//
// let itemsNew = [];
//
// for (i = 2; i >= 0; i--) {
//     itemsNew.push(items[i]);
// }
//
// console.log(itemsNew);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let items = [1, 2, 3];
//
// for (let i = 2; i < 5; i++) {
//     items.push(items[i] + 1);
// }
//
// console.log(items);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

// let items = [1, 2, 3];
//
// for (let i = 0; i < 1; i++) {
//     items.unshift(4, 5, 6, )
// }
//
// console.log(items);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].

// let items = [1, 2, 3, 4, 5];
//
// for (let i = 0; i < 3; i++) {
//     items.shift();
// }
//
// console.log(items);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].

// let items = [1, 2, 3, 4, 5];
//
// for (let i = 2; i < 5; i++) {
//     items.pop();
// }
//
// console.log(items);

//----------------------------------------------------------------------------------------------------------------------

// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].

// let items = [1, 2, 3, 4, 5];
//
// for (let i = 3; i < 5; i++) {
//     items.pop();
// }
//
// for (let i = 3; i < 4; i++) {
//     items.push('a', 'b', 'c');
// }
//
// console.log(items);

//----------------------------------------------------------------------------------------------------------------------

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let items = [22,34,55,33,8,13,80,99,57,10];
//
// for (let i = 0; i < items.length; i++) {
//     if (items[i] % 2 === 0) {
//         console.log(items[i])
//     }
// }

//----------------------------------------------------------------------------------------------------------------------

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let emptyArr = [];
//
// for (let i = 0; i < arr.length; i++) {
//     emptyArr.push(arr[i]);
// }
//
// console.log(emptyArr);

//----------------------------------------------------------------------------------------------------------------------

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

// let arr = ['a', 'b', 'c'];
//
// for (let i = 0; i < arr.length; i++) {
//     document.write(arr [i]);
// }

//----------------------------------------------------------------------------------------------------------------------

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

// let arr = ['a', 'b', 'c'];
//
// let i = 0
//
// while (i < arr.length) {
//     document.write(arr[i]);
//     i++
// }

//----------------------------------------------------------------------------------------------------------------------

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// let arr = ['a', 'b', 'c'];
//
// for (item of arr) {
//     document.write(item);
// }

//----------------------------------------------------------------------------------------------------------------------

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// function someFunc(arr, index) {
//     for (i = 0; i < arr.length; i++ ) {
//         if (i === index) {
//             let del = arr.splice(i, 1);
//             arr.splice(i+1, 0, del[0]);
//         }
//     }
//     console.log(arr);
// }
//
// someFunc([9, 8, 0, 4], 2);

//----------------------------------------------------------------------------------------------------------------------

// - Дано список імен.
// let n1 = '    Harry       Potter      '
// let n2 = '    Ron       Whisley      '
// let n3 = '    Hermione       Granger      '
// Написати функцію, яка приймає будь яке не валідне імя, та нормалізує його в наступнйи вигляд
// let n1 = 'Harry Potter'
// let n2 = 'Ron Whisley'
// let n3 = 'Hermione Granger'

// let n1 = '    Harry       Potter      '
// let n2 = '    Ron       Whisley      '
// let n3 = '    Hermione       Granger      '
//
// let arrNames  = [n1, n2, n3];
//
// for (i=0; i < arrNames.length; i++) {
//     validName(arrNames[i]);
// }
//
// function validName() {
//     let nameNew = arrNames[i].replaceAll(' ', '');
//     document.write(`<p>${nameNew}</p>`);
// }

//----------------------------------------------------------------------------------------------------------------------

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

function someFunc(arr) {
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] === 0) {
            let del = arr.splice(i, 1);
            arr.push(del[0]);
        }
    }
    console.log(arr)
}

someFunc([1,0,6,0,3]);